podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_8CH_QDCTRL_S32K142.svd.xml
            <cluster>
               <dim>$(CONTROLS_COUNT)</dim>
               <dimIncrement>8</dimIncrement>
               <name>CONTROLS,@pC@i@f</name>
               <addressOffset>0xC</addressOffset>
               <register>
                  <name>CnSC</name>
                  <description>Channel %s Status and Control</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>DMA</name>
                        <description>DMA Transfer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>DMA disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>DMA enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ICRST</name>
                        <description>FTM counter reset by the selected input capture event</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>FTM counter is not reset when the selected channel input event is detected</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>FTM counter is reset when the selected channel input event is detected</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELS</name>
                        <?ignoreOverlap?>
                        <description>Edge or Level Select\n
Determine edge sensitivity of IC or output action of OC and pulse polarity of PWM\n
Edge sensitivity/Output polarity/Pulse polarity</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>Inactive</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b01</name>
                              <description>Rising/Toggle/Low</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b10</name>
                              <description>Falling/Clear/High</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b11</name>
                              <description>Either/Set/Low</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELSA</name>
                        <?hide?>
                        <description>Edge or Level Select A</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ELSB</name>
                        <?hide?>
                        <description>Edge or Level Select B</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MS</name>
                        <?ignoreOverlap?>
                        <description>Channel Mode Select\n
Determines Input Capture, Output Compare &amp; Pulse Width Modulation</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>Input capture</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b01</name>
                              <description>Output compare</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1X</name>
                              <description>Pulse Width Modulation</description>
                              <value>0b1X</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSA</name>
                        <?hide?>
                        <description>Channel Mode Select A</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSB</name>
                        <?hide?>
                        <description>Channel Mode Select B</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CHIE</name>
                        <description>Channel Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Interrupts disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Interrupts enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHF</name>
                        <description>Channel Flag\nSet when a channel event occurs</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No channel event</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Channel event</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGMODE</name>
                        <description>Trigger mode control</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Channel outputs will generate the normal PWM outputs without generating a pulse</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>If a match in the channel occurs, a trigger generation on channel output will happen. The trigger pulse width has one FTM clock cycle</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHIS</name>
                        <description>Channel Input State</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel input is zero</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel input is one</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHOV</name>
                        <description>Channel Output Value</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel output is zero</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel output is one</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CnV</name>
                  <description>Channel %s Value</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>VAL</name>
                        <description>Channel Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CNTIN</name>
               <description>Counter Initial Value</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initial Value of the FTM Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Capture and Compare Status</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>CH0F</name>
                     <description>Channel 0 Event Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0F" > <name>CH1F</name> <description>Channel 1 Event Flag</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH2F</name> <description>Channel 2 Event Flag</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH3F</name> <description>Channel 3 Event Flag</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH4F</name> <description>Channel 4 Event Flag</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH5F</name> <description>Channel 5 Event Flag</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH6F</name> <description>Channel 6 Event Flag</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0F" > <name>CH7F</name> <description>Channel 7 Event Flag</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>MODE</name>
               <description>Features Mode Selection</description>
               <addressOffset>0x54</addressOffset>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>FTMEN</name>
                     <description>FTM Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TPM registers only\t (first set of registers) can be used without any restriction. Do not use the FTM-specific</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>All registers\t including the FTM-specific registers (second set of registers) are available for use with no restrictions</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Initialize the Channel Outputs</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to initialise</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPDIS</name>
                     <description>Write Protection Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMSYNC</name>
                     <description>PWM Synchronization Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No restrictions.\t Software and hardware triggers can be used by MOD, CnV, OUTMASK, and FTM counter synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Restricted\t Software trigger can only be used by MOD and CnV synchronization, and hardware triggers can only be used by OUTMASK and FTM counter synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPTEST</name>
                     <description>Capture Test Mode Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAULTM</name>
                     <description>Fault Control Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Even channels with manual fault clearing</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>All channels with manual fault clearing</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>All channels with automatic fault clearing</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CAPTEST" > <name>FAULTIE</name> <description>Fault Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
