podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_8CH_QDCTRL_S32K142.svd.xml
            <register derivedFrom="PAIR0DEADTIME"> <name>PAIR1DEADTIME</name> <description>Pair 1 Deadtime Configuration</description> <addressOffset>0xA8</addressOffset> </register>
            <register derivedFrom="PAIR0DEADTIME"> <name>PAIR2DEADTIME</name> <description>Pair 2 Deadtime Configuration</description> <addressOffset>0xB0</addressOffset> </register>
            <register derivedFrom="PAIR0DEADTIME"> <name>PAIR3DEADTIME</name> <description>Pair 3 Deadtime Configuration</description> <addressOffset>0xB8</addressOffset> </register>
            <register>
               <name>MOD_MIRROR</name>
               <description>Mirror of Modulo Value</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>FRACMOD</name>
                     <description>Modulo Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>MOD</name>
                     <description>Mirror of the Modulo Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C0V_MIRROR</name>
               <description>Mirror of Channel Match Value</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>FRACVAL</name>
                     <description>Channel Match Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>VAL</name>
                     <description>Mirror of the Channel Match Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="C0V_MIRROR"> <name>C1V_MIRROR</name> <addressOffset>0x208</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C2V_MIRROR</name> <addressOffset>0x20C</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C3V_MIRROR</name> <addressOffset>0x210</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C4V_MIRROR</name> <addressOffset>0x214</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C5V_MIRROR</name> <addressOffset>0x218</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C6V_MIRROR</name> <addressOffset>0x21C</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C7V_MIRROR</name> <addressOffset>0x220</addressOffset> </register>
         </registers>
      </peripheral>
